# Managers with at Least 5 Direct Reports

In [ ]:
Table: Employee

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
| department  | varchar |
| managerId   | int     |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table indicates the name of an employee, their department, and the id of their manager.
If managerId is null, then the employee does not have a manager.
No employee will be the manager of themself.
 

Write a solution to find managers with at least five direct reports.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+-----+-------+------------+-----------+
| id  | name  | department | managerId |
+-----+-------+------------+-----------+
| 101 | John  | A          | None      |
| 102 | Dan   | A          | 101       |
| 103 | James | A          | 101       |
| 104 | Amy   | A          | 101       |
| 105 | Anne  | A          | 101       |
| 106 | Ron   | B          | 101       |
+-----+-------+------------+-----------+
Output: 
+------+
| name |
+------+
| John |
+------+

In [5]:
import pandas as pd

# Sample data
data = {
    'id': [101, 102, 103, 104, 105, 106],
    'name': ['John', 'Dan', 'James', 'Amy', 'Anne', 'Ron'],
    'department': ['A', 'A', 'A', 'A', 'A', 'B'],
    'managerId': [None, 101, 101, 101, 101, 101]
}

# Create DataFrame
employee = pd.DataFrame(data)

In [8]:
employee

    id   name department  managerId
0  101   John          A        NaN
1  102    Dan          A      101.0
2  103  James          A      101.0
3  104    Amy          A      101.0
4  105   Anne          A      101.0
5  106    Ron          B      101.0

In [6]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    
    result_df = pd.merge(employee, employee, left_on='managerId', right_on='id', suffixes=('', '_manager'))
    output_df = result_df[['name', 'name_manager','managerId']]
    output=output_df.groupby(['name_manager','managerId'])['name'].agg(['count']).reset_index()
    manager_id=output.query('count>=5')['managerId'].unique()
    result =employee[employee['id'].isin(manager_id)][['name']]
    return result

In [7]:
find_managers(employee)

   name
0  John